Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/leave_and_holidays/maternity_leave.html.txt.tmx
Source language: en
Languages: ga

source: You may only request that your maternity leave be postponed once you have taken at least 14 weeks' maternity leave, 4 of which must have been taken after the birth
ga: Ní féidir leat a iarraidh go gcuirfí siar do shaoire mháithreachais go dtí go mbíonn 14 sheachtain ar a laghad de do shaoire mháithreachais tógtha agat, agus ní mór duit 4 cinn acu siúd a bheith tógtha agat tar éis breith do linbh

source: (This provision does not apply to fathers who are on maternity leave)
ga: (Ní bhaineann an fhoráil seo le haithreacha atá ar saoire mháithreachais)

source: If you postpone your maternity leave and return to work, then you may take your leave in one block, not later than 7 days after the child has been discharged from hospital
ga: Má chuireann tú do shaoire mháithreachais siar, agus má fhilleann tú ar do chuid oibre, féadfaidh tú do shaoire go léir a ghlacadh le chéile ag tosú tráth nach déanaí ná 7 lá ón am a scaoiltear do leanbh amach as an ospidéal

source: Your employer may request a letter from the hospital confirming the child has been hospitalised and following discharge, a letter confirming the date of discharge
ga: Féadfaidh d’fhostóir litir a iarraidh ón ospidéal ag dearbhú gur coinníodh do leanbh san ospidéal agus litir eile ina dhiaidh sin ag dearbhú an dáta ar ligeadh amach é nó í

source: If you postpone your maternity leave and return to employment, you need to notify the Department of Social Protection of this
ga: Má chuireann tú do shaoire mháithreachais siar agus má fhilleann tú ar d’fhostaíocht, ní mór duit é sin a chur in iúl don Roinn Coimirce Sóisialaí

source: You must notify them in writing that your child has been hospitalised and you have returned to employment
ga: Caithfidh tú a insint dóibh i scríbhinn gur coinníodh do leanbh san ospidéal agus gur fhill tú ar do chuid oibre

source: A letter from your family doctor (GP)/hospital is required to confirm to the Department that the child has been discharged from hospital and your maternity benefit should resume
ga: Ní mór litir a fháil ó do dhochtúir teaghlaigh dochtúir ginearálta nó ón ospidéal le dearbhú don Roinn gur scaoileadh do leanbh amach as an ospidéal agus ba chóir go gcuirfí tús le do shochar máithreachais an athuair

source: Your Personal Public Service Number (PPS) Number should be clearly identified on all documents you send to the Department
ga: Ba chóir d’Uimhir Phearsanta Seirbhíse Poiblí (Uimhir PSP) a bheith le feiceáil go soiléir ar gach cáipéis a chuireann tú chun na Roinne

source: Remember, you may only apply to postpone your maternity leave if the baby has been hospitalised - not if the child is simply unwell
ga: Cuimhnigh nach mbeidh tú in ann iarratas a dhéanamh chun do shaoire mháithreachais a chur siar ach amháin má choinnítear do leanbh san ospidéal - ní leor díreach é nó í a bheith tinn

source: Illness while on postponed maternity leave
ga: Breoiteacht le linn duit a bheith ar saoire mháithreachais a cuireadh siar

source: If you have postponed your maternity leave and become ill when you return to work (before resuming your postponed leave), you may be considered to have started your resumed leave on the first day of your absence because of illness
ga: Má chuireann tú siar do shaoire mháithreachais, agus má éiríonn tú tinn tar éis duit filleadh ar do chuid oibre (sula gcuireann tú tús leis an tsaoire a chuir tú siar), féadfar glacadh leis gur chuir tú tús le do shaoire atosaithe ar an gcéad lá a raibh tú as láthair de bharr breoiteachta

source: Alternatively, you may choose to forfeit your right to resumed leave and have your leave treated as sick leave
ga: Nó féadfaidh tú do cheart a fhorghéilleadh maidir le hatosú do shaoire agus glacadh le do shaoire mar saoire bhreoiteachta
